app/controllers/music_player_controller.rb

SELECT `playlists`.* FROM `playlists` WHERE `playlists`.`user_id` = 4
---
	def index
		@name = session[:name]
		@playlists = Playlist.get_all(session[:user_id])
		@pSize = @playlists.size

INSERT INTO `playlists` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('Hello there', 3, '2015-03-08 10:33:54.889367', '2015-03-08 10:33:54.889367')
---
    def create_playlist
    	Playlist.create_playlist(params[:name], session[:user_id])

SELECT `musics`.* FROM `musics` WHERE `musics`.`user_id` = 4 AND `musics`.`playlist_id` = 0
---
    def play
   		@name = session[:name]
    	if !Playlist.inPlaylist(params[:playlist_name], session[:user_id])
    		redirect_to '/index'
    	end
    	p = Playlist.getPlaylist(params[:playlist_name], session[:user_id])
   		session[:playlist_id] = p.id;
   		session[:playlist_name] = p.name;
   		@playlist_name = p.name
   		@songs = Music.get_all(session[:user_id], session[:playlist_id])
   		@mSize = @songs.size

INSERT INTO `musics` (`name`, `path`, `user_id`, `playlist_id`, `created_at`, `updated_at`) VALUES ('fast', 'public/uploads/01 Going Out.mp3', 4, 5, '2015-03-08 15:18:01.784548', '2015-03-08 15:18:01.784548')
---
    def upload_music
    	music_name = params[:name]
    	name = params[:upload]
    	fname = name.original_filename
    	dir = 'public/uploads'
    	path = File.join(dir, fname)
    	File.open(path, "wb") do |f| f.write(name.read)
    	end
    	Music.create_music(music_name, path, session[:user_id], session[:playlist_id])