app/controllers/session_controller.rb

INSERT INTO `users` (`name`, `username`, `password`, `salt`, `created_at`, `updated_at`) VALUES ('chris', 'test', '$2a$10$kcbP7B64n/HzoJ2x4iXZzeDq.L3jpnH9EJ3AgRYUhwnXlOismzMt2', '$2a$10$kcbP7B64n/HzoJ2x4iXZze', '2015-03-08 07:12:20.140073', '2015-03-08 07:12:20.140073')
---
  def register_user
    if params[:pass] == params[:cPass] && User.checkDB(params[:username])
      user = User.createUser(params[:username], params[:name], params[:pass])